import AbstractView from "./AbstractView";

export default class extends AbstractView {
    constructor(params) {
        super(params);
        this.setTitle("Biography");
    }

    async getHtml() {
        return `
            <h1>Ο Οδυσσέας Ελύτης,</h1>
            <p>
                 ήταν ένας από τους σημαντικότερους Έλληνες ποιητές, μέλος της λογοτεχνικής γενιάς του '30. 
                 Βραβεύτηκε το 1960 με το Κρατικό Βραβείο Ποίησης και το 1979 με το βραβείο Νόμπελ Λογοτεχνίας, ο δεύτερος και τελευταίος μέχρι σήμερα Έλληνας που τιμήθηκε με βραβείο Νόμπελ Λογοτεχνίας. 
                 Γνωστότερα ποιητικά του έργα είναι τα Άξιον εστί, ο Ήλιος ο πρώτος και οι Προσανατολισμοί. 
                 Διαμόρφωσε ένα προσωπικό ποιητικό ιδίωμα και θεωρείται ένας από τους ανανεωτές της ελληνικής ποίησης. 
                 Πολλά ποιήματά του μελοποιήθηκαν, ενώ συλλογές του έχουν μεταφραστεί μέχρι σήμερα σε πολλές ξένες γλώσσες. 
                 Το έργο του περιλαμβάνει ακόμα μεταφράσεις ποιητικών και θεατρικών έργων. 
                 Υπήρξε μέλος της Διεθνούς Ένωσης Κριτικών Έργων Τέχνης και της Ευρωπαϊκής Εταιρείας Κριτικής, αντιπρόσωπος στις Rencontres Internationales της Γενεύης και Incontro Romano della Cultura της Ρώμης.
            </p>
            <p>
                <a href="/posts" data-link>View recent posts</a>.
            </p>
        `;
    }
}